In [1]:
import sqlite3

In [2]:
from sqlite3 import Error

In [3]:
def create_connection(path):
    connection = None
    try:
        connection = sqlite3.connect(path)
        print("Connection to SQLite DB succesful")
    except Error as e:
        print(f'The error {e} occurred')
    return connection

In [4]:
connection = create_connection("sm_app.sqlite")

Connection to SQLite DB succesful

In [5]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as e:
        print(f"The error '{e}' occurred")

In [6]:
create_users_table = """
CREATE TABLE IF NOT EXISTS users (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  name TEXT NOT NULL,
  age INTEGER,
  gender TEXT,
  nationality TEXT
);
"""

In [7]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as e:
        print(f"The error '{e}' occurred")

In [8]:
create_users_table = """
CREATE TABLE IF NOT EXISTS users (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  name TEXT NOT NULL,
  age INTEGER,
  gender TEXT,
  nationality TEXT
);
"""

In [9]:
execute_query(connection, create_users_table)

Query executed successfully

In [10]:
import sqlite3
from sqlite3 import Error

def create_connection(path):
    connection = None
    try:
        connection = sqlite3.connect(path)
        print("Connection to SQLite DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

In [11]:
connection = create_connection("sm_app.sqlite")

Connection to SQLite DB successful

In [12]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as e:
        print(f"The error '{e}' occurred")

In [13]:
create_users_table = """
CREATE TABLE IF NOT EXISTS users (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  name TEXT NOT NULL,
  age INTEGER,
  gender TEXT,
  nationality TEXT
);
"""

In [14]:
execute_query(connection, create_users_table)

Query executed successfully

In [15]:
create_posts_table = """
CREATE TABLE IF NOT EXISTS posts(
  id INTEGER PRIMARY KEY AUTOINCREMENT, 
  title TEXT NOT NULL, 
  description TEXT NOT NULL, 
  user_id INTEGER NOT NULL, 
  FOREIGN KEY (user_id) REFERENCES users (id)
);
"""

In [16]:
execute_query(connection, create_posts_table)

Query executed successfully

In [17]:
create_comments_table = """
CREATE TABLE IF NOT EXISTS comments (
  id INTEGER PRIMARY KEY AUTOINCREMENT, 
  text TEXT NOT NULL, 
  user_id INTEGER NOT NULL, 
  post_id INTEGER NOT NULL, 
  FOREIGN KEY (user_id) REFERENCES users (id) FOREIGN KEY (post_id) REFERENCES posts (id)
);
"""

create_likes_table = """
CREATE TABLE IF NOT EXISTS likes (
  id INTEGER PRIMARY KEY AUTOINCREMENT, 
  user_id INTEGER NOT NULL, 
  post_id integer NOT NULL, 
  FOREIGN KEY (user_id) REFERENCES users (id) FOREIGN KEY (post_id) REFERENCES posts (id)
);
"""

execute_query(connection, create_comments_table)  
execute_query(connection, create_likes_table)

Query executed successfully
Query executed successfully

In [18]:
create_users = """
INSERT INTO
  users (name, age, gender, nationality)
VALUES
  ('James', 25, 'male', 'USA'),
  ('Leila', 32, 'female', 'France'),
  ('Brigitte', 35, 'female', 'England'),
  ('Mike', 40, 'male', 'Denmark'),
  ('Elizabeth', 21, 'female', 'Canada');
"""

execute_query(connection, create_users)

Query executed successfully

In [19]:
create_posts = """
INSERT INTO
  posts (title, description, user_id)
VALUES
  ("Happy", "I am feeling very happy today", 1),
  ("Hot Weather", "The weather is very hot today", 2),
  ("Help", "I need some help with my work", 2),
  ("Great News", "I am getting married", 1),
  ("Interesting Game", "It was a fantastic game of tennis", 5),
  ("Party", "Anyone up for a late-night party today?", 3);
"""

execute_query(connection, create_posts)

Query executed successfully

In [20]:
create_comments = """
INSERT INTO
  comments (text, user_id, post_id)
VALUES
  ('Count me in', 1, 6),
  ('What sort of help?', 5, 3),
  ('Congrats buddy', 2, 4),
  ('I was rooting for Nadal though', 4, 5),
  ('Help with your thesis?', 2, 3),
  ('Many congratulations', 5, 4);
"""

create_likes = """
INSERT INTO
  likes (user_id, post_id)
VALUES
  (1, 6),
  (2, 3),
  (1, 5),
  (5, 4),
  (2, 4),
  (4, 2),
  (3, 6);
"""

execute_query(connection, create_comments)
execute_query(connection, create_likes)

Query executed successfully
Query executed successfully

In [21]:
def execute_read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as e:
        print(f"The error '{e}' occurred")

In [22]:
select_users = "SELECT * from users"
users = execute_read_query(connection, select_users)

for user in users:
    print(user)

(1, 'James', 25, 'male', 'USA')
(2, 'Leila', 32, 'female', 'France')
(3, 'Brigitte', 35, 'female', 'England')
(4, 'Mike', 40, 'male', 'Denmark')
(5, 'Elizabeth', 21, 'female', 'Canada')
(6, 'James', 25, 'male', 'USA')
(7, 'Leila', 32, 'female', 'France')
(8, 'Brigitte', 35, 'female', 'England')
(9, 'Mike', 40, 'male', 'Denmark')
(10, 'Elizabeth', 21, 'female', 'Canada')
(11, 'James', 25, 'male', 'USA')
(12, 'Leila', 32, 'female', 'France')
(13, 'Brigitte', 35, 'female', 'England')
(14, 'Mike', 40, 'male', 'Denmark')
(15, 'Elizabeth', 21, 'female', 'Canada')

In [23]:
import sqlite3
from sqlite3 import Error

def create_connection(path):
    connection = None
    try:
        connection = sqlite3.connect(path)
        print("Connection to SQLite DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

In [24]:
connection1 = create_connection('hr.db')

Connection to SQLite DB successful

In [25]:
select = '''
SELECT first_name,last_name,salary,0.12*salary AS PF FROM EMPLOYEES
'''

In [26]:
result1 = execute_read_query(connection1,select)

In [27]:
result1

[('Steven', 'King', 24000.0, 2880.0),
 ('Neena', 'Kochhar', 17000.0, 2040.0),
 ('Lex', 'De Haan', 17000.0, 2040.0),
 ('Alexander', 'Hunold', 9000.0, 1080.0),
 ('Bruce', 'Ernst', 6000.0, 720.0),
 ('David', 'Austin', 4800.0, 576.0),
 ('Valli', 'Pataballa', 4800.0, 576.0),
 ('Diana', 'Lorentz', 4200.0, 504.0),
 ('Nancy', 'Greenberg', 12000.0, 1440.0),
 ('Daniel', 'Faviet', 9000.0, 1080.0),
 ('John', 'Chen', 8200.0, 984.0),
 ('Ismael', 'Sciarra', 7700.0, 924.0),
 ('Jose Manuel', 'Urman', 7800.0, 936.0),
 ('Luis', 'Popp', 6900.0, 828.0),
 ('Den', 'Raphaely', 11000.0, 1320.0),
 ('Alexander', 'Khoo', 3100.0, 372.0),
 ('Shelli', 'Baida', 2900.0, 348.0),
 ('Sigal', 'Tobias', 2800.0, 336.0),
 ('Guy', 'Himuro', 2600.0, 312.0),
 ('Karen', 'Colmenares', 2500.0, 300.0),
 ('Matthew', 'Weiss', 8000.0, 960.0),
 ('Adam', 'Fripp', 8200.0, 984.0),
 ('Payam', 'Kaufling', 7900.0, 948.0),
 ('Shanta', 'Vollman', 6500.0, 780.0),
 ('Irene', 'Mikkilineni', 2700.0, 324.0),
 ('John', 'Russell', 14000.0, 1680.0),
 ('Karen', 'Partners', 13500.0, 1620.0),
 ('Jonathon', 'Taylor', 8600.0, 1032.0),
 ('Jack', 'Livingston', 8400.0, 1008.0),
 ('Kimberely', 'Grant', 7000.0, 840.0),
 ('Charles', 'Johnson', 6200.0, 744.0),
 ('Sarah', 'Bell', 4000.0, 480.0),
 ('Britney', 'Everett', 3900.0, 468.0),
 ('Jennifer', 'Whalen', 4400.0, 528.0),
 ('Michael', 'Hartstein', 13000.0, 1560.0),
 ('Pat', 'Fay', 6000.0, 720.0),
 ('Susan', 'Mavris', 6500.0, 780.0),
 ('Hermann', 'Baer', 10000.0, 1200.0),
 ('Shelley', 'Higgins', 12000.0, 1440.0),
 ('William', 'Gietz', 8300.0, 996.0)]

In [28]:
select = '''
SELECT first_name,last_name,employees.department_id FROM employees
JOIN departments
ON employees.department_id = departments.department_id
WHERE department_name IN ('Purchasing','Finance')
ORDER BY employees.department_id
'''

In [29]:
result1 = execute_read_query(connection1,select)

In [30]:
result1

[('Den', 'Raphaely', 3),
 ('Alexander', 'Khoo', 3),
 ('Shelli', 'Baida', 3),
 ('Sigal', 'Tobias', 3),
 ('Guy', 'Himuro', 3),
 ('Karen', 'Colmenares', 3),
 ('Nancy', 'Greenberg', 10),
 ('Daniel', 'Faviet', 10),
 ('John', 'Chen', 10),
 ('Ismael', 'Sciarra', 10),
 ('Jose Manuel', 'Urman', 10),
 ('Luis', 'Popp', 10)]

In [31]:
select = '''
SELECT job_id, MAX(salary) - MIN(salary) OVER (PARTITION BY job_id) AS salary_span FROM employees
'''

result1 = execute_read_query(connection1,select)

result1

[(4, 0.0)]

In [32]:
select = '''
SELECT department_name, COUNT(employee_id) FROM departments
JOIN employees ON departments.department
'''

result1 = execute_read_query(connection1,select)

result1

In [33]:
df = pd.read_sql(select,connection1)

In [34]:
df.sort_values(by='job_id')

   job_id  salary_span
0       4          0.0

In [35]:
select = '''
SELECT * FROM departments
'''

result1 = execute_read_query(connection1,select)

result1

[(1, 'Administration', 1700),
 (2, 'Marketing', 1800),
 (3, 'Purchasing', 1700),
 (4, 'Human Resources', 2400),
 (5, 'Shipping', 1500),
 (6, 'IT', 1400),
 (7, 'Public Relations', 2700),
 (8, 'Sales', 2500),
 (9, 'Executive', 1700),
 (10, 'Finance', 1700),
 (11, 'Accounting', 1700)]

administration, purchasing, shipping, it, executive, finance, accounting
1,3,5,6,9,10,11

In [36]:
select = '''
SELECT * FROM employees
'''

result1 = execute_read_query(connection1,select)

result1

[(100,
  'Steven',
  'King',
  'steven.king@sqltutorial.org',
  '515.123.4567',
  '1987-06-17',
  4,
  24000.0,
  None,
  9),
 (101,
  'Neena',
  'Kochhar',
  'neena.kochhar@sqltutorial.org',
  '515.123.4568',
  '1989-09-21',
  5,
  17000.0,
  100,
  9),
 (102,
  'Lex',
  'De Haan',
  'lex.de haan@sqltutorial.org',
  '515.123.4569',
  '1993-01-13',
  5,
  17000.0,
  100,
  9),
 (103,
  'Alexander',
  'Hunold',
  'alexander.hunold@sqltutorial.org',
  '590.423.4567',
  '1990-01-03',
  9,
  9000.0,
  102,
  6),
 (104,
  'Bruce',
  'Ernst',
  'bruce.ernst@sqltutorial.org',
  '590.423.4568',
  '1991-05-21',
  9,
  6000.0,
  103,
  6),
 (105,
  'David',
  'Austin',
  'david.austin@sqltutorial.org',
  '590.423.4569',
  '1997-06-25',
  9,
  4800.0,
  103,
  6),
 (106,
  'Valli',
  'Pataballa',
  'valli.pataballa@sqltutorial.org',
  '590.423.4560',
  '1998-02-05',
  9,
  4800.0,
  103,
  6),
 (107,
  'Diana',
  'Lorentz',
  'diana.lorentz@sqltutorial.org',
  '590.423.5567',
  '1999-02-07',
  9,
  4200.0,
  103,
  6),
 (108,
  'Nancy',
  'Greenberg',
  'nancy.greenberg@sqltutorial.org',
  '515.124.4569',
  '1994-08-17',
  7,
  12000.0,
  101,
  10),
 (109,
  'Daniel',
  'Faviet',
  'daniel.faviet@sqltutorial.org',
  '515.124.4169',
  '1994-08-16',
  6,
  9000.0,
  108,
  10),
 (110,
  'John',
  'Chen',
  'john.chen@sqltutorial.org',
  '515.124.4269',
  '1997-09-28',
  6,
  8200.0,
  108,
  10),
 (111,
  'Ismael',
  'Sciarra',
  'ismael.sciarra@sqltutorial.org',
  '515.124.4369',
  '1997-09-30',
  6,
  7700.0,
  108,
  10),
 (112,
  'Jose Manuel',
  'Urman',
  'jose manuel.urman@sqltutorial.org',
  '515.124.4469',
  '1998-03-07',
  6,
  7800.0,
  108,
  10),
 (113,
  'Luis',
  'Popp',
  'luis.popp@sqltutorial.org',
  '515.124.4567',
  '1999-12-07',
  6,
  6900.0,
  108,
  10),
 (114,
  'Den',
  'Raphaely',
  'den.raphaely@sqltutorial.org',
  '515.127.4561',
  '1994-12-07',
  14,
  11000.0,
  100,
  3),
 (115,
  'Alexander',
  'Khoo',
  'alexander.khoo@sqltutorial.org',
  '515.127.4562',
  '1995-05-18',
  13,
  3100.0,
  114,
  3),
 (116,
  'Shelli',
  'Baida',
  'shelli.baida@sqltutorial.org',
  '515.127.4563',
  '1997-12-24',
  13,
  2900.0,
  114,
  3),
 (117,
  'Sigal',
  'Tobias',
  'sigal.tobias@sqltutorial.org',
  '515.127.4564',
  '1997-07-24',
  13,
  2800.0,
  114,
  3),
 (118,
  'Guy',
  'Himuro',
  'guy.himuro@sqltutorial.org',
  '515.127.4565',
  '1998-11-15',
  13,
  2600.0,
  114,
  3),
 (119,
  'Karen',
  'Colmenares',
  'karen.colmenares@sqltutorial.org',
  '515.127.4566',
  '1999-08-10',
  13,
  2500.0,
  114,
  3),
 (120,
  'Matthew',
  'Weiss',
  'matthew.weiss@sqltutorial.org',
  '650.123.1234',
  '1996-07-18',
  19,
  8000.0,
  100,
  5),
 (121,
  'Adam',
  'Fripp',
  'adam.fripp@sqltutorial.org',
  '650.123.2234',
  '1997-04-10',
  19,
  8200.0,
  100,
  5),
 (122,
  'Payam',
  'Kaufling',
  'payam.kaufling@sqltutorial.org',
  '650.123.3234',
  '1995-05-01',
  19,
  7900.0,
  100,
  5),
 (123,
  'Shanta',
  'Vollman',
  'shanta.vollman@sqltutorial.org',
  '650.123.4234',
  '1997-10-10',
  19,
  6500.0,
  100,
  5),
 (126,
  'Irene',
  'Mikkilineni',
  'irene.mikkilineni@sqltutorial.org',
  '650.124.1224',
  '1998-09-28',
  18,
  2700.0,
  120,
  5),
 (145,
  'John',
  'Russell',
  'john.russell@sqltutorial.org',
  None,
  '1996-10-01',
  15,
  14000.0,
  100,
  8),
 (146,
  'Karen',
  'Partners',
  'karen.partners@sqltutorial.org',
  None,
  '1997-01-05',
  15,
  13500.0,
  100,
  8),
 (176,
  'Jonathon',
  'Taylor',
  'jonathon.taylor@sqltutorial.org',
  None,
  '1998-03-24',
  16,
  8600.0,
  100,
  8),
 (177,
  'Jack',
  'Livingston',
  'jack.livingston@sqltutorial.org',
  None,
  '1998-04-23',
  16,
  8400.0,
  100,
  8),
 (178,
  'Kimberely',
  'Grant',
  'kimberely.grant@sqltutorial.org',
  None,
  '1999-05-24',
  16,
  7000.0,
  100,
  8),
 (179,
  'Charles',
  'Johnson',
  'charles.johnson@sqltutorial.org',
  None,
  '2000-01-04',
  16,
  6200.0,
  100,
  8),
 (192,
  'Sarah',
  'Bell',
  'sarah.bell@sqltutorial.org',
  '650.501.1876',
  '1996-02-04',
  17,
  4000.0,
  123,
  5),
 (193,
  'Britney',
  'Everett',
  'britney.everett@sqltutorial.org',
  '650.501.2876',
  '1997-03-03',
  17,
  3900.0,
  123,
  5),
 (200,
  'Jennifer',
  'Whalen',
  'jennifer.whalen@sqltutorial.org',
  '515.123.4444',
  '1987-09-17',
  3,
  4400.0,
  101,
  1),
 (201,
  'Michael',
  'Hartstein',
  'michael.hartstein@sqltutorial.org',
  '515.123.5555',
  '1996-02-17',
  10,
  13000.0,
  100,
  2),
 (202,
  'Pat',
  'Fay',
  'pat.fay@sqltutorial.org',
  '603.123.6666',
  '1997-08-17',
  11,
  6000.0,
  201,
  2),
 (203,
  'Susan',
  'Mavris',
  'susan.mavris@sqltutorial.org',
  '515.123.7777',
  '1994-06-07',
  8,
  6500.0,
  101,
  4),
 (204,
  'Hermann',
  'Baer',
  'hermann.baer@sqltutorial.org',
  '515.123.8888',
  '1994-06-07',
  12,
  10000.0,
  101,
  7),
 (205,
  'Shelley',
  'Higgins',
  'shelley.higgins@sqltutorial.org',
  '515.123.8080',
  '1994-06-07',
  2,
  12000.0,
  101,
  11),
 (206,
  'William',
  'Gietz',
  'william.gietz@sqltutorial.org',
  '515.123.8181',
  '1994-06-07',
  1,
  8300.0,
  205,
  11)]

In [1]:
import psycopg2

con = psycopg2.connect(database="mid_term_project", user="lhl_student", password="lhl_student", host="mid-term-project.ca2jkepgjpne.us-east-2.rds.amazonaws.com", port="5432")

In [2]:
con